In [40]:
import sqlite3

In [41]:
print(sqlite3.version)
print(sqlite3.sqlite_version)

2.6.0
3.35.4

In [42]:
#connect to the database
db = sqlite3.connect(':memory:')

In [43]:
#create a cursor to use to execute SQL statements
cursor = db.cursor()

In [44]:
#use the cursor to execute SQL statements to the database
cursor.execute('''
               CREATE TABLE books(
                   id INTEGER PRIMARY KEY,
                   title TEXT, author TEXT, price TEXT, year TEXT
               )
               ''')
db.commit()

In [45]:
cursor.execute('''
               INSERT INTO books values(1, 'Pro Powershell', 'Bryan Cafferky', 35.00, 2015)
               
               ''')
cursor.execute('''
               INSERT INTO books values(2, "Hithikers guide to the Galaxy", 'Douglas Adams', 12.00, 1999)
               
               ''')
db.commit()

In [46]:
lstbooks = cursor.execute('''
                          select * from books
                          ''').fetchall()

In [47]:
print(lstbooks)

[(1, 'Pro Powershell', 'Bryan Cafferky', '35.0', '2015'), (2, 'Hithikers guide to the Galaxy', 'Douglas Adams', '12.0', '1999')]

In [48]:
import pandas as pd 
import sqlite3

In [49]:
dfbook = pd.read_sql_query('SELECT * FROM books', db)

In [50]:
dfbook.head(3)

   id                          title          author price  year
0   1                 Pro Powershell  Bryan Cafferky  35.0  2015
1   2  Hithikers guide to the Galaxy   Douglas Adams  12.0  1999

In [51]:
'''#drop the table
cursor = db.cursor()
cursor.execute('''
               DROP TABLE books
               ''')
db.commit()'''

IndentationError: unexpected indent (<ipython-input-51-ee3bd7ef8f84>, line 4)

In [ ]:
'''bookdf = cursor.execute('''
                        select * from books;
                        ''').fetchall()
db.commit()'''

OperationalError: no such table: books

In [54]:
conn = sqlite3.connect('chinook.db')
cur = conn.cursor()

In [55]:
albums = cur.execute("""select * from  albums order by title limit 3;""").fetchall()

In [59]:
print(albums)
type(albums)

[(156, '...And Justice For All', 50), (257, '20th Century Masters - The Millennium Collection: The Best of Scorpions', 179), (296, 'A Copland Celebration, Vol. I', 230)]

list

In [65]:
dfalbum = pd.read_sql_query('SELECT * FROM albums', conn)
dfalbum.head(3)

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2

In [66]:
pd.read_sql_query("select name from sqlite_master where type = 'table' ;", conn)

               name
0            albums
1   sqlite_sequence
2           artists
3         customers
4         employees
5            genres
6          invoices
7     invoice_items
8       media_types
9         playlists
10   playlist_track
11           tracks
12     sqlite_stat1